duanlin/onlyx/board/GD32E503.h
#ifndef GD32E503_H
#define GD32E503_H


#define GD32E503_USART0_BASE 0x40013800
#define GD32E503_USART1_BASE 0x40004400
#define GD32E503_USART2_BASE 0x40004800
#define GD32E503_USART3_BASE 0x40004C00
#define GD32E503_USART4_BASE 0x40005000
#define GD32E503_USART0(REG_OFFSET) (GD32E503_USART0_BASE + (REG_OFFSET))
#define GD32E503_USART1(REG_OFFSET) (GD32E503_USART1_BASE + (REG_OFFSET))
#define GD32E503_USART2(REG_OFFSET) (GD32E503_USART2_BASE + (REG_OFFSET))
#define GD32E503_USART3(REG_OFFSET) (GD32E503_USART3_BASE + (REG_OFFSET))
#define GD32E503_USART4(REG_OFFSET) (GD32E503_USART4_BASE + (REG_OFFSET))

#define GD32E503_USART_STAT0 0x0000
#define GD32E503_USART_DATA 0x0004
#define GD32E503_USART_BAUD 0x0008
#define GD32E503_USART_CTL0 0x000C
#define GD32E503_USART_CTL1 0x0010
#define GD32E503_USART_CTL2 0x0014
#define GD32E503_USART_GP 0x0018
#define GD32E503_USART_CTL3 0x0080
#define GD32E503_USART_RT 0x0084
#define GD32E503_USART_STAT1 0x0088
#define GD32E503_USART_GDCTL 0x00D0

#define GD32E503_CAN0_BASE 0x40006400
#define GD32E503_CAN1_BASE 0x40006800
#define GD32E503_CAN0(REG_OFFSET) (GD32E503_CAN0_BASE + (REG_OFFSET))
#define GD32E503_CAN1(REG_OFFSET) (GD32E503_CAN1_BASE + (REG_OFFSET))

#define GD32E503_CAN_CTL 0x0000
#define GD32E503_CAN_STAT 0x0004
#define GD32E503_CAN_TSTAT 0x0008
#define GD32E503_CAN_RFIFO0 0x000C
#define GD32E503_CAN_RFIFO1 0x0010
#define GD32E503_CAN_INTEN 0x0014
#define GD32E503_CAN_ERR 0x0018
#define GD32E503_CAN_BT 0x001C
#define GD32E503_CAN_FDCTL 0x0020
#define GD32E503_CAN_FDSTAT 0x0024
#define GD32E503_CAN_FDTDC 0x0028
#define GD32E503_CAN_DBT 0x002C
#define GD32E503_CAN_TMI0 0x0180
#define GD32E503_CAN_TMP0 0x0184
#define GD32E503_CAN_TMDATA0 0x0188
#define GD32E503_CAN_TMDATA1 0x018C
#define GD32E503_CAN_RFIFOMI0 0x01B0
#define GD32E503_CAN_RFIFOMP0 0x01B4
#define GD32E503_CAN_RFIFOMDATA0 0x01B8
#define GD32E503_CAN_RFIFOMDATA1 0x01BC
#define GD32E503_CAN_FCTL 0x0200
#define GD32E503_CAN_FMCFG 0x0204
#define GD32E503_CAN_FSCFG 0x020C
#define GD32E503_CAN_FAFIFO 0x0214
#define GD32E503_CAN_FW 0x021C
#define GD32E503_CAN_F0DATA0 0x0240
#define GD32E503_CAN_F0DATA1 0x0244

#define GD32E503_TIMER0_BASE 0x40012C00
#define GD32E503_TIMER1_BASE 0x40000000
#define GD32E503_TIMER2_BASE 0x40000400
#define GD32E503_TIMER3_BASE 0x40000800
#define GD32E503_TIMER4_BASE 0x40000C00
#define GD32E503_TIMER5_BASE 0x40001000
#define GD32E503_TIMER6_BASE 0x40001400
#define GD32E503_TIMER1(REG_OFFSET) (GD32E503_TIMER1_BASE + (REG_OFFSET))
#define GD32E503_TIMER2(REG_OFFSET) (GD32E503_TIMER2_BASE + (REG_OFFSET))
#define GD32E503_TIMER3(REG_OFFSET) (GD32E503_TIMER3_BASE + (REG_OFFSET))
#define GD32E503_TIMER4(REG_OFFSET) (GD32E503_TIMER4_BASE + (REG_OFFSET))
#define GD32E503_TIMER5(REG_OFFSET) (GD32E503_TIMER5_BASE + (REG_OFFSET))
#define GD32E503_TIMER6(REG_OFFSET) (GD32E503_TIMER6_BASE + (REG_OFFSET))

#define GD32E503_TIMERL0_CTL0 0x0000
#define GD32E503_TIMERL0_CTL1 0x0004
#define GD32E503_TIMERL0_SMCFG 0x0008
#define GD32E503_TIMERL0_DMAINTEN 0x000C
#define GD32E503_TIMERL0_INTF 0x0010
#define GD32E503_TIMERL0_SWEVG 0x0014
#define GD32E503_TIMERL0_CHCTL0 0x0018
#define GD32E503_TIMERL0_CHCTL1 0x001C
#define GD32E503_TIMERL0_CHCTL2 0x0020
#define GD32E503_TIMERL0_CNT 0x0024
#define GD32E503_TIMERL0_PSC 0x0028
#define GD32E503_TIMERL0_CAR 0x002C
#define GD32E503_TIMERL0_CH0CV 0x0034
#define GD32E503_TIMERL0_CH1CV 0x0038
#define GD32E503_TIMERL0_CH2CV 0x003C
#define GD32E503_TIMERL0_CH3CV 0x0040
#define GD32E503_TIMERL0_DMACFG 0x0048
#define GD32E503_TIMERL0_DMATB 0x004C0
#define GD32E503_TIMERL0_CFG 0x00FC

#define GD32E503_TIMERB_CTL0 0x0000
#define GD32E503_TIMERB_CTL1 0x0004
#define GD32E503_TIMERB_DMAINTEN 0x000C
#define GD32E503_TIMERB_INTF 0x0010
#define GD32E503_TIMERB_SWEVG 0x0014
#define GD32E503_TIMERB_CNT 0x0024
#define GD32E503_TIMERB_PSC 0x0028
#define GD32E503_TIMERB_CAR 0x002C

#define GD32E503_GPIOA_BASE 0x40010800
#define GD32E503_GPIOB_BASE 0x40010C00
#define GD32E503_GPIOC_BASE 0x40011000
#define GD32E503_GPIOD_BASE 0x40011400
#define GD32E503_GPIOE_BASE 0x40011800
#define GD32E503_GPIOF_BASE 0x40011C00
#define GD32E503_GPIOG_BASE 0x40012000
#define GD32E503_GPIOA(REG_OFFSET) (GD32E503_GPIOA_BASE + (REG_OFFSET))
#define GD32E503_GPIOB(REG_OFFSET) (GD32E503_GPIOB_BASE + (REG_OFFSET))
#define GD32E503_GPIOC(REG_OFFSET) (GD32E503_GPIOC_BASE + (REG_OFFSET))
#define GD32E503_GPIOD(REG_OFFSET) (GD32E503_GPIOD_BASE + (REG_OFFSET))
#define GD32E503_GPIOE(REG_OFFSET) (GD32E503_GPIOE_BASE + (REG_OFFSET))
#define GD32E503_GPIOF(REG_OFFSET) (GD32E503_GPIOF_BASE + (REG_OFFSET))
#define GD32E503_GPIOG(REG_OFFSET) (GD32E503_GPIOG_BASE + (REG_OFFSET))

#define GD32E503_GPIO_CTL0 0x0000
#define GD32E503_GPIO_CTL1 0x0004
#define GD32E503_GPIO_ISTAT 0x0008
#define GD32E503_GPIO_OCTL 0x000C
#define GD32E503_GPIO_BOP 0x0010
#define GD32E503_GPIO_BC 0x0014
#define GD32E503_GPIO_LOCK 0x0018
#define GD32E503_GPIO_SPD 0x003C

#define GD32E503_AFIO_BASE 0x40010000
#define GD32E503_AFIO(REG_OFFSET) (GD32E503_AFIO_BASE + (REG_OFFSET))

#define GD32E503_AFIO_EC 0x0000
#define GD32E503_AFIO_PCF0 0x0004
#define GD32E503_AFIO_EXTISS0 0x0008
#define GD32E503_AFIO_EXTISS1 0x000C
#define GD32E503_AFIO_EXTISS2 0x0010
#define GD32E503_AFIO_EXTISS3 0x0014
#define GD32E503_AFIO_PCF1 0x001C
#define GD32E503_AFIO_CPSCTL 0x0020
#define GD32E503_AFIO_PCFA 0x003C
#define GD32E503_AFIO_PCFB 0x0040
#define GD32E503_AFIO_PCFC 0x0044
#define GD32E503_AFIO_PCFD 0x0048
#define GD32E503_AFIO_PCFE 0x004C
#define GD32E503_AFIO_PCFG 0x0054

#define GD32E503_EXTI_BASE 0x40010400
#define GD32E503_EXTI(REG_OFFSET) (GD32E503_EXTI_BASE + (REG_OFFSET))

#define GD32E503_EXTI_INTEN 0x0000
#define GD32E503_EXTI_EVEN 0x0004
#define GD32E503_EXTI_RTEN 0x0008
#define GD32E503_EXTI_FTEN 0x000C
#define GD32E503_EXTI_SWIEV 0x0010
#define GD32E503_EXTI_PD 0x0014

#define GD32E503_RCU_BASE 0x40021000
#define GD32E503_RCU(REG_OFFSET) (GD32E503_RCU_BASE + (REG_OFFSET))

#define GD32E503_RCU_CTL 0x0000
#define GD32E503_RCU_CFG0  0x0004
#define GD32E503_RCU_INT 0x0008
#define GD32E503_RCU_APB2RST 0x000C
#define GD32E503_RCU_APB1RST 0x0010
#define GD32E503_RCU_AHBEN 0x0014
#define GD32E503_RCU_APB2EN 0x0018
#define GD32E503_RCU_APB1EN 0x001C
#define GD32E503_RCU_BDCTL 0x0020
#define GD32E503_RCU_RSTSCK 0x0024
#define GD32E503_RCU_AHBRST 0x0028
#define GD32E503_RCU_CFG1 0x002C
#define GD32E503_RCU_DSV 0x0034
#define GD32E503_RCU_ADDCTL 0x00C0
#define GD32E503_RCU_ADDINT 0x00CC
#define GD32E503_RCU_PLLSSCTL 0x00D0
#define GD32E503_RCU_CFG2 0x00D4
#define GD32E503_RCU_ADDAPB1RST 0x00E0
#define GD32E503_RCU_ADDAPB1EN 0x00E4

#define GD32E503_FMC_BASE 0x40022000
#define GD32E503_FMC(REG_OFFSET) (GD32E503_FMC_BASE + (REG_OFFSET))

#define GD32E503_FMC_WS 0x0000
#define GD32E503_FMC_KEY 0x0004
#define GD32E503_FMC_OBKEY 0x0008
#define GD32E503_FMC_STAT 0x000C
#define GD32E503_FMC_CTL 0x0010
#define GD32E503_FMC_ADDR 0x0014
#define GD32E503_FMC_OBSTAT 0x001C
#define GD32E503_FMC_WP 0x0020
#define GD32E503_FMC_PDI 0x0100


#endif
